# <center>**Pandas**</center>

### **Pandas** created by **McKinney**, Pandas stands for **Panel Data** library. It is most popular data analysis library for Python and it comes with many tools tha we will learn now.

### Pandas Series
#### Series is built on top of a Numpy array. The differentiating factor between an numpy array and Pandas series is that a series can have a named index

In [83]:
import numpy as np # import numpy
import pandas as pd # import pandas
import warnings #library to ignore warnings
warnings.simplefilter(action='ignore', category=FutureWarning) #ignoring warnings

In [84]:
labels = ['a', 'b', 'c'] # create a list of labels

In [85]:
mylist = [10, 20, 30] # create a list of values

In [86]:
arr = np.array(mylist) # create a numpy array

In [87]:
arr

array([10, 20, 30])

In [88]:
d = {'a':10, 'b':20, 'c':30} # create a dictionary

In [89]:
pd.Series(data=mylist) # create a series from a list

0    10
1    20
2    30
dtype: int64

In [90]:
pd.Series(arr) # create a series from a numpy array

0    10
1    20
2    30
dtype: int64

In [91]:
pd.Series(data = arr, index=labels) # create a series from a numpy array with labels

a    10
b    20
c    30
dtype: int64

In [92]:
pd.Series(data = [10, 'a', 20]) # create a series with mixed data types

0    10
1     a
2    20
dtype: object

In [93]:
ser1 = pd.Series([1,2,3,4], index=['USA', 'Germany', 'USSR', 'Japan']) # create a series with labels

In [94]:
ser1

USA        1
Germany    2
USSR       3
Japan      4
dtype: int64

In [95]:
ser1['USA']

1

In [96]:
ser2 = pd.Series([1,4,5,6], index=['USA', 'Germany', 'Italy', 'Japan']) # create a series with labels
ser2

USA        1
Germany    4
Italy      5
Japan      6
dtype: int64

In [97]:
ser1 + ser2 # add two series

Germany     6.0
Italy       NaN
Japan      10.0
USA         2.0
USSR        NaN
dtype: float64

### **DataFrames**
#### **DataFrame** is simply multiple series that share the same index. It is essentially a tabular data storage format.

In [98]:
from numpy.random import randn # import random number generator
np.random.seed(101) # set seed for random number generator
rand_mat = randn(5,4) # create a random matrix

In [99]:
rand_mat

array([[ 2.70684984,  0.62813271,  0.90796945,  0.50382575],
       [ 0.65111795, -0.31931804, -0.84807698,  0.60596535],
       [-2.01816824,  0.74012206,  0.52881349, -0.58900053],
       [ 0.18869531, -0.75887206, -0.93323722,  0.95505651],
       [ 0.19079432,  1.97875732,  2.60596728,  0.68350889]])

In [100]:
df = pd.DataFrame(data=rand_mat, index='A B C D E'.split(), columns='W Y X Z'.split()) # create a dataframe from a matrix
df # display the dataframe

          W         Y         X         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [101]:
df['W'] # display a column

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [102]:
mylist = ['W', 'Y'] # create a list of column names
df[mylist] # display a list of columns

          W         Y
A  2.706850  0.628133
B  0.651118 -0.319318
C -2.018168  0.740122
D  0.188695 -0.758872
E  0.190794  1.978757

In [103]:
df.W # display a column

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [104]:
df['NEW'] = df['W'] + df['Y'] # create a new column
df # display the dataframe

          W         Y         X         Z       NEW
A  2.706850  0.628133  0.907969  0.503826  3.334983
B  0.651118 -0.319318 -0.848077  0.605965  0.331800
C -2.018168  0.740122  0.528813 -0.589001 -1.278046
D  0.188695 -0.758872 -0.933237  0.955057 -0.570177
E  0.190794  1.978757  2.605967  0.683509  2.169552

In [105]:
df.drop('NEW', axis=1) # drop a column's data

          W         Y         X         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [106]:
df # display the dataframe

          W         Y         X         Z       NEW
A  2.706850  0.628133  0.907969  0.503826  3.334983
B  0.651118 -0.319318 -0.848077  0.605965  0.331800
C -2.018168  0.740122  0.528813 -0.589001 -1.278046
D  0.188695 -0.758872 -0.933237  0.955057 -0.570177
E  0.190794  1.978757  2.605967  0.683509  2.169552

In [107]:
df.drop('NEW', axis=1, inplace=True) # drop a column's data
df # display the dataframe

          W         Y         X         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [108]:
df.loc['A'] # display a row by label

W    2.706850
Y    0.628133
X    0.907969
Z    0.503826
Name: A, dtype: float64

In [109]:
df.iloc[0] # display a row by index

W    2.706850
Y    0.628133
X    0.907969
Z    0.503826
Name: A, dtype: float64

In [110]:
df.loc[['A', 'E']]

          W         Y         X         Z
A  2.706850  0.628133  0.907969  0.503826
E  0.190794  1.978757  2.605967  0.683509

In [111]:
df.iloc[[0,3]]

          W         Y         X         Z
A  2.706850  0.628133  0.907969  0.503826
D  0.188695 -0.758872 -0.933237  0.955057

In [112]:
df.loc[['A', 'B']][['Y', 'Z']]

          Y         Z
A  0.628133  0.503826
B -0.319318  0.605965

In [113]:
df > 0 # display a boolean dataframe

       W      Y      X      Z
A   True   True   True   True
B   True  False  False   True
C  False   True   True  False
D   True  False  False   True
E   True   True   True   True

In [114]:
df_bool = df > 0 # create a boolean dataframe
df[df_bool] # display a dataframe with boolean values

          W         Y         X         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [115]:
df[df>0] # display a dataframe with boolean values

          W         Y         X         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [116]:
df[df['W'] > 0] # display a dataframe with boolean values

          W         Y         X         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [117]:
cond1 = df['W'] > 0 # create a boolean series
cond2 = df['Y'] > 1 # create a boolean series

In [118]:
df[(cond1) & (cond2)] # display a dataframe with boolean values

          W         Y         X         Z
E  0.190794  1.978757  2.605967  0.683509

In [119]:
df

          W         Y         X         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [120]:
df.reset_index() # reset the index

  index         W         Y         X         Z
0     A  2.706850  0.628133  0.907969  0.503826
1     B  0.651118 -0.319318 -0.848077  0.605965
2     C -2.018168  0.740122  0.528813 -0.589001
3     D  0.188695 -0.758872 -0.933237  0.955057
4     E  0.190794  1.978757  2.605967  0.683509

In [121]:
df

          W         Y         X         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [122]:
newind = 'CA NY WY OR CO'.split() # create a list of new index values

In [123]:
df['States'] = newind # create a new column
df

          W         Y         X         Z States
A  2.706850  0.628133  0.907969  0.503826     CA
B  0.651118 -0.319318 -0.848077  0.605965     NY
C -2.018168  0.740122  0.528813 -0.589001     WY
D  0.188695 -0.758872 -0.933237  0.955057     OR
E  0.190794  1.978757  2.605967  0.683509     CO

In [124]:
df.set_index('States', inplace=True) # set the index

In [125]:
df

               W         Y         X         Z
States
CA      2.706850  0.628133  0.907969  0.503826
NY      0.651118 -0.319318 -0.848077  0.605965
WY     -2.018168  0.740122  0.528813 -0.589001
OR      0.188695 -0.758872 -0.933237  0.955057
CO      0.190794  1.978757  2.605967  0.683509

In [126]:
df.info() # display information about the dataframe

<class 'pandas.core.frame.DataFrame'>
Index: 5 entries, CA to CO
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   W       5 non-null      float64
 1   Y       5 non-null      float64
 2   X       5 non-null      float64
 3   Z       5 non-null      float64
dtypes: float64(4)
memory usage: 200.0+ bytes

In [127]:
df.dtypes # display the data types of the dataframe

W    float64
Y    float64
X    float64
Z    float64
dtype: object

In [128]:
df.describe() # display a summary of the dataframe

              W         Y         X         Z
count  5.000000  5.000000  5.000000  5.000000
mean   0.343858  0.453764  0.452287  0.431871
std    1.681131  1.061385  1.454516  0.594708
min   -2.018168 -0.758872 -0.933237 -0.589001
25%    0.188695 -0.319318 -0.848077  0.503826
50%    0.190794  0.628133  0.528813  0.605965
75%    0.651118  0.740122  0.907969  0.683509
max    2.706850  1.978757  2.605967  0.955057

In [129]:
df['W'] > 0 # display a boolean series

States
CA     True
NY     True
WY    False
OR     True
CO     True
Name: W, dtype: bool

In [130]:
ser_w = df['W'] > 0 # create a boolean series

In [131]:
ser_w.value_counts() # display the value counts of the boolean series

True     4
False    1
Name: W, dtype: int64

In [132]:
sum(ser_w) # display the sum of the boolean series

4

In [133]:
len(ser_w) # display the length of the boolean series

5

### **Group By**
#### Often you may want to perform an analysis based off the value of specific column, meaning you want to group together other columns based off another. In order to do this, we to perform 3 steps.

#### Group By Operaions involve: Split, Apply, Combine. Pandas does all of this for this with a simple method call: .groupby()

In [134]:
data = {'Company' : ['GOOG', 'GOOG', 'MSFT', 'MSFT', 'FB', 'FB'], 
        'Person' : ['Sam', 'Charlie', 'Amy', 'Vanessa', 'Carl', 'Sarah'], 
        'Sales' : [200, 120, 340, 124, 243, 350]} # create a dictionary

In [135]:
df = pd.DataFrame(data) # create a dataframe from a dictionary

In [136]:
df

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [137]:
df.groupby('Company').mean() # group the dataframe by a column and display the mean, or you can use .sum(), .count(), .std(), .min(), .max()

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

In [138]:
df.groupby('Company').describe() # group the dataframe by a column and display the summary statistics

        Sales
        count   mean         std    min     25%    50%     75%    max
Company
FB        2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
GOOG      2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
MSFT      2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0

In [139]:
df.groupby('Company').describe().transpose() #group the dataframe by a column and display the summary statistics and transpose the dataframe for better readability

Company              FB        GOOG        MSFT
Sales count    2.000000    2.000000    2.000000
      mean   296.500000  160.000000  232.000000
      std     75.660426   56.568542  152.735065
      min    243.000000  120.000000  124.000000
      25%    269.750000  140.000000  178.000000
      50%    296.500000  160.000000  232.000000
      75%    323.250000  180.000000  286.000000
      max    350.000000  200.000000  340.000000

### **Pandas operations**

In [140]:
df = pd.DataFrame({'col1':[1,2,3,4], 'col2':[444,555,666,444], 'col3':['abc','def','ghi','xyz']}) # create a dataframe
df.head() # display the first five rows of the dataframe

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [141]:
df['col2'].unique() # display the unique values of a column

array([444, 555, 666])

In [142]:
df['col2'].nunique() # display the number of unique values of a column

3

In [143]:
df['col2'].value_counts() # display the value counts of a column

444    2
555    1
666    1
Name: col2, dtype: int64

In [144]:
#Col 1 is greater than 2
#Col 2 is equal to 444
ndf = df[(df['col1']>2) & (df['col2']==444)] # create a new dataframe with boolean values
ndf # display the new dataframe

   col1  col2 col3
3     4   444  xyz

In [145]:
def times2(x): # create a function
    return x*2 # return the value of x times 2

In [146]:
times2(5) # call the function

10

In [147]:
df['col1'].apply(times2) # apply the function to the dataframe

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

In [148]:
df['2xcol1'] = df['col1'].apply(times2) # create a new column with the function applied
df # display the dataframe

   col1  col2 col3  2xcol1
0     1   444  abc       2
1     2   555  def       4
2     3   666  ghi       6
3     4   444  xyz       8

In [149]:
del df['2xcol1'] # delete a column

In [150]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [151]:
df.columns # display the column names

Index(['col1', 'col2', 'col3'], dtype='object')

In [152]:
df.index # display the index

RangeIndex(start=0, stop=4, step=1)

In [153]:
df.info() # display information about the dataframe

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   col1    4 non-null      int64
 1   col2    4 non-null      int64
 2   col3    4 non-null      object
dtypes: int64(2), object(1)
memory usage: 224.0+ bytes

In [154]:
df.describe() # display a summary of the dataframe

           col1        col2
count  4.000000    4.000000
mean   2.500000  527.250000
std    1.290994  106.274409
min    1.000000  444.000000
25%    1.750000  444.000000
50%    2.500000  499.500000
75%    3.250000  582.750000
max    4.000000  666.000000

In [155]:
df.sort_values('col2') # sort the dataframe by a column

   col1  col2 col3
0     1   444  abc
3     4   444  xyz
1     2   555  def
2     3   666  ghi

### **Data input and Output**
#### Visit this website inorder to see what type of files you can get access using pandas: https://pandas.pydata.org/docs/user_guide/io.html

In [156]:
CSV_data = pd.read_csv('dataset/bank.csv') # read a csv file
CSV_data.head() # display the first five rows of the dataframe

,age,job,marital,education,default,balance,housing,loan,contact,day,month,duration,campaign,pdays,previous,poutcome,y
0,30,unemployed,married,primary,no,1787,no,no,cellular,19,oct,79,1,-1,0,unknown,no
1,33,services,married,secondary,no,4789,yes,yes,cellular,11,may,220,1,339,4,failure,no
2,35,management,single,tertiary,no,1350,yes,no,cellular,16,apr,185,1,330,1,failure,no
3,30,management,married,tertiary,no,1476,yes,yes,unknown,3,jun,199,4,-1,0,unknown,no
4,59,blue-collar,married,secondary,no,0,yes,no,unknown,5,may,226,1,-1,0,unknown,no

In [157]:
xlsx_data = pd.read_excel('dataset/Excel_Sample.xlsx', sheet_name='Sheet1') # read an excel file
xlsx_data.head() # display the first five rows of the dataframe

   Unnamed: 0   a   b   c   d
0           0   0   1   2   3
1           1   4   5   6   7
2           2   8   9  10  11
3           3  12  13  14  15

In [158]:
xlsx_data.columns # display the column names

Index(['Unnamed: 0', 'a', 'b', 'c', 'd'], dtype='object')

In [159]:
xlsx_data.drop('Unnamed: 0', axis=1, inplace=True) # drop a column
xlsx_data.head() # display the first five rows of the dataframe

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [160]:
new_data = xlsx_data[['a', 'b']] # create a new dataframe with a subset of columns
new_data.head() # display the first five rows of the dataframe

    a   b
0   0   1
1   4   5
2   8   9
3  12  13

In [161]:
new_data.to_csv('dataset/new_data.csv', index=False) # save the dataframe as a csv file